tutorials/incompressible/porousSimpleFoam/angledDuctImplicit/0/epsilon
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 200;

boundaryField
{
    front
    {
        type            epsilonWallFunction;
        value           uniform 200;
    }

    back
    {
        type            epsilonWallFunction;
        value           uniform 200;
    }

    wall
    {
        type            epsilonWallFunction;
        value           uniform 200;
    }

    porosityWall
    {
        type            epsilonWallFunction;
        value           uniform 200;
    }

    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        value           uniform 200;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 200;
        value           uniform 200;
    }
}


// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
