tutorials/incompressible/porousSimpleFoam/angledDuctImplicit/0/k
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 1;

boundaryField
{
    front
    {
        type            kqRWallFunction;
        value           uniform 1;
    }

    back
    {
        type            kqRWallFunction;
        value           uniform 1;
    }

    wall
    {
        type            kqRWallFunction;
        value           uniform 1;
    }

    porosityWall
    {
        type            kqRWallFunction;
        value           uniform 1;
    }

    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 1;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
}


// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
