tutorials/incompressible/porousSimpleFoam/angledDuctImplicit/0/nut
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            nutWallFunction;
        value           uniform 0;
    }

    back
    {
        type            nutWallFunction;
        value           uniform 0;
    }

    wall
    {
        type            nutWallFunction;
        value           uniform 0;
    }

    porosityWall
    {
        type            nutWallFunction;
        value           uniform 0;
    }

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }
}


// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
